[
  {
    "id": "creational",
    "title": "Creational",
    "color": "0xFFF3D250",
    "patterns": [
      {
        "id": "abstract-factory",
        "title": "Abstract Factory",
        "description": "Provide an interface for creating families of related or dependent objects without specifying their concrete classes.",
        "route": "/abstract-factory"
      },
      {
        "id": "factory-method",
        "title": "Factory Method",
        "description": "Define an interface for creating an object, but let subclasses decide which class to instantiate. Factory Method lets a class defer instantiation to sub­classes.",
        "route": "/factory-method"
      },
      {
        "id": "singleton",
        "title": "Singleton",
        "description": "Ensure a class only has one instance, and provide a global point of access to it.",
        "route": "/singleton"
      }
    ]
  },
  {
    "id": "structural",
    "title": "Structural",
    "color": "0xFF90CCF4",
    "patterns": [
      {
        "id": "adapter",
        "title": "Adapter",
        "description": "Convert the interface of a class into another interface clients expect. Adapter lets classes work together that couldn't otherwise because of incompatible interfaces.",
        "route": "/adapter"
      },
      {
        "id": "composite",
        "title": "Composite",
        "description": "Compose objects into tree structures to represent part-whole hierarchies. Composite lets clients treat individual objects and compositions of objects uniformly.",
        "route": "/composite"
      },
      {
        "id": "facade",
        "title": "Facade",
        "description": "Provide an unified interface to a set of interfaces in a subsystem. Facade defines a higher-level interface that makes the subsystem easier to use.",
        "route": "/facade"
      }
    ]
  },
  {
    "id": "behavioral",
    "title": "Behavioral",
    "color": "0xFFF78888",
    "patterns": [
      {
        "id": "command",
        "title": "Command",
        "description": "Encapsulate a request as an object, thereby letting you parameterize clients with different requests, queue or log requests, and support undoable opera­tions.",
        "route": "/command"
      },
      {
        "id": "interpreter",
        "title": "Interpreter",
        "description": "Given a language, define a representation for its grammar along with an inter­preter that uses the representation to interpret sentences in the language.",
        "route": "/interpreter"
      },
      {
        "id": "iterator",
        "title": "Iterator",
        "description": "Provide a way to access the elements of an aggregate object sequentially without exposing its underlying representation.",
        "route": "/iterator"
      },
      {
        "id": "state",
        "title": "State",
        "description": "Allow an object to alter its behavior when its internal state changes. The object will appear to change its class.",
        "route": "/state"
      },
      {
        "id": "strategy",
        "title": "Strategy",
        "description": "Define a family of algorithms, encapsulate each one, and make them interchange­able. Strategy lets the algorithm vary independently from clients that use it.",
        "route": "/strategy"
      },
      {
        "id": "template-method",
        "title": "Template Method",
        "description": "Define the skeleton of an algorithm in an operation, deferring some steps to sub­classes. Template Method lets subclasses redefine certain steps of an algorithm without changing the algorithm's structure.",
        "route": "/template-method"
      }
    ]
  }
]
